ncverilog(64): 15.20-s058: (c) Copyright 1995-2018 Cadence Design Systems, Inc.
TOOL:	ncverilog	15.20-s058: Started on May 04, 2023 at 21:21:20 CEST
ncverilog
	+sv
	-f files_verilog.f
		../Verilog/RTL/alu.v
		../Verilog/RTL/alu_control.v
		../Verilog/RTL/branch_unit.v
		../Verilog/RTL/control_unit.v
		../Verilog/RTL/cpu.v
		../Verilog/RTL/immediate_extend_unit.v
		../Verilog/RTL/mux_2.v
		../Verilog/RTL/pc.v
		../Verilog/RTL/reg_arstn.v
		../Verilog/RTL/reg_arstn_en.v
		../Verilog/RTL/register_file.v
		../Verilog/RTL/sram.v
		../Verilog/cpu_tb.v
		../Verilog/sky130_sram_2rw.v
		../Verilog/RTL/forward_unit.v
		../Verilog/RTL/mux_3.v
	+nc64bit
	+nctimescale+1ns/10ps
	+access+rwc
	-ALLOWREDEFINITION
	-linedebug
	+gui
ncverilog: *W,BADPRF: The -linedebug option may have an adverse performance impact.
file: ../Verilog/RTL/alu.v
	module worklib.alu:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/alu_control.v
	module worklib.alu_control:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/branch_unit.v
	module worklib.branch_unit:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/control_unit.v
	module worklib.control_unit:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/cpu.v
	module worklib.cpu:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/immediate_extend_unit.v
	module worklib.immediate_extend_unit:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/mux_2.v
	module worklib.mux_2:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/pc.v
	module worklib.pc:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/reg_arstn.v
	module worklib.reg_arstn:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/reg_arstn_en.v
	module worklib.reg_arstn_en:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/register_file.v
	module worklib.register_file:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/sram.v
	module worklib.sram_BW32:v
		errors: 0, warnings: 0
	module worklib.sram_BW64:v
		errors: 0, warnings: 0
file: ../Verilog/cpu_tb.v
	module worklib.cpu_tb:v
		errors: 0, warnings: 0
file: ../Verilog/sky130_sram_2rw.v
	module worklib.sky130_sram_2rw_32x128_32:v
		errors: 0, warnings: 0
	module worklib.sky130_sram_2rw_64x128_64:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/forward_unit.v
	module worklib.forward_unit:v
		errors: 0, warnings: 0
file: ../Verilog/RTL/mux_3.v
	module worklib.mux_3:v
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
ncelab: *W,DSEMEL: This SystemVerilog design will be simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.alu:v <0x18d0087c>
			streams:   7, words: 10906
		worklib.alu_control:v <0x39f9f4dd>
			streams:   3, words:  3066
		worklib.branch_unit:v <0x32f315b0>
			streams:   2, words:  1193
		worklib.control_unit:v <0x2fd13cf3>
			streams:   1, words:  9260
		worklib.cpu:v <0x0f6c3c3d>
			streams:  13, words:  2334
		worklib.cpu_tb:v <0x19c36fab>
			streams:  27, words: 82568
		worklib.forward_unit:v <0x28aec2ea>
			streams:   1, words:  2280
		worklib.immediate_extend_unit:v <0x4af86e3f>
			streams:   3, words:  4029
		worklib.mux_2:v <0x265681f0>
			streams:   1, words:   795
		worklib.mux_3:v <0x66285e8f>
			streams:   1, words:  1124
		worklib.pc:v <0x2497f589>
			streams:   5, words:  2178
		worklib.reg_arstn:v <0x48df47db>
			streams:   5, words:  1529
		worklib.reg_arstn_en:v <0x2b157fbc>
			streams:   5, words:  1806
		worklib.reg_arstn_en:v <0x32f0ad80>
			streams:   5, words:  1794
		worklib.reg_arstn_en:v <0x41f41faa>
			streams:   5, words:  2015
		worklib.reg_arstn_en:v <0x5460b5d2>
			streams:   5, words:  1811
		worklib.register_file:v <0x2601a80d>
			streams:   5, words:  7694
		worklib.sky130_sram_2rw_32x128_32:v <0x33efe7f8>
			streams:   6, words:  4808
		worklib.sky130_sram_2rw_64x128_64:v <0x46df11a1>
			streams:   6, words:  6844
		worklib.sram_BW32:v <0x3daa9a7f>
			streams:  11, words:  6567
		worklib.sram_BW64:v <0x786a680c>
			streams:  11, words:  6757
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                  Instances  Unique
		Modules:                 54      18
		Registers:              174     106
		Scalar wires:            49       -
		Vectored wires:          71       -
		Always blocks:          109      41
		Initial blocks:           3       3
		Cont. assignments:       37       5
		Pseudo assignments:      43      43
		Simulation timescale:  10ps
	Writing initial simulation snapshot: worklib.reg_arstn:v
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.

-------------------------------------
Relinquished control to SimVision...
ncsim> 
ncsim> source /esat/micas-data/software/Cadence/incisiv_15.20.058/tools/inca/files/ncsimrc
ncsim> database -open waves -into waves.shm -default
Created default SHM database waves
ncsim> probe -create -shm cpu_tb.dut.instruction cpu_tb.dut.regfile_wdata
Created probe 1
ncsim> run

Start Execution

[1;31m
Error in Mult3 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000001
Debug info, reg_array[          9]: 0000000000000002
Debug info, reg_array[         10]: 0000000000000003
Debug info, reg_array[         11]: 0000000000000004
Debug info, reg_array[         12]: 0000000000000005
Debug info, reg_array[         13]: 0000000000000006
Debug info, reg_array[         14]: 0000000000000007
Debug info, reg_array[         15]: 0000000000000008
Debug info, reg_array[         16]: 0000000000000009
Debug info, reg_array[         17]: 0000000000000000
Debug info, reg_array[         18]: 0000000000000051
Debug info, reg_array[         19]: 0000000000000000
Debug info, reg_array[         20]: 00000000000019a1
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 000000000290d741
Debug info, reg_array[         23]: 000000000cd43445
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         25 cycles
Simulation complete via $finish(1) at time 30950 NS + 8
../Verilog/cpu_tb.v:324    $finish;
ncsim> probe -create -shm cpu_tb.dut.mem_data_MEM_WB cpu_tb.dut.alu_out_MEM_WB cpu_tb.dut.mem_2_reg_MEM_WB
Created probe 2
ncsim> run
ncsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
ncsim> reset
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.reg_arstn:v
ncsim> run

Start Execution

[1;31m
Error in Mult3 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000001
Debug info, reg_array[          9]: 0000000000000002
Debug info, reg_array[         10]: 0000000000000003
Debug info, reg_array[         11]: 0000000000000004
Debug info, reg_array[         12]: 0000000000000005
Debug info, reg_array[         13]: 0000000000000006
Debug info, reg_array[         14]: 0000000000000007
Debug info, reg_array[         15]: 0000000000000008
Debug info, reg_array[         16]: 0000000000000009
Debug info, reg_array[         17]: 0000000000000000
Debug info, reg_array[         18]: 0000000000000051
Debug info, reg_array[         19]: 0000000000000000
Debug info, reg_array[         20]: 00000000000019a1
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 000000000290d741
Debug info, reg_array[         23]: 000000000cd43445
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         25 cycles
Simulation complete via $finish(1) at time 30950 NS + 8
../Verilog/cpu_tb.v:324    $finish;
ncsim> probe -create -shm cpu_tb.dut.mem_data
Created probe 3
ncsim> reset
ncsim: *W,DSEM2009: This SystemVerilog design is simulated as per IEEE 1800-2009 SystemVerilog simulation semantics. Use -disable_sem2009 option for turning off SV 2009 simulation semantics.
Loaded snapshot worklib.reg_arstn:v
ncsim> run

Start Execution

[1;31m
Error in Mult3 function
[0m
Debug info, reg_array[          0]: 0000000000000000
Debug info, reg_array[          1]: 0000000000000000
Debug info, reg_array[          2]: 0000000000000000
Debug info, reg_array[          3]: 0000000000000000
Debug info, reg_array[          4]: 0000000000000000
Debug info, reg_array[          5]: 0000000000000000
Debug info, reg_array[          6]: 0000000000000000
Debug info, reg_array[          7]: 0000000000000000
Debug info, reg_array[          8]: 0000000000000001
Debug info, reg_array[          9]: 0000000000000002
Debug info, reg_array[         10]: 0000000000000003
Debug info, reg_array[         11]: 0000000000000004
Debug info, reg_array[         12]: 0000000000000005
Debug info, reg_array[         13]: 0000000000000006
Debug info, reg_array[         14]: 0000000000000007
Debug info, reg_array[         15]: 0000000000000008
Debug info, reg_array[         16]: 0000000000000009
Debug info, reg_array[         17]: 0000000000000000
Debug info, reg_array[         18]: 0000000000000051
Debug info, reg_array[         19]: 0000000000000000
Debug info, reg_array[         20]: 00000000000019a1
Debug info, reg_array[         21]: 0000000000000000
Debug info, reg_array[         22]: 000000000290d741
Debug info, reg_array[         23]: 000000000cd43445
Debug info, reg_array[         24]: 0000000000000000
Debug info, reg_array[         25]: 0000000000000000
Debug info, reg_array[         26]: 0000000000000000
Debug info, reg_array[         27]: 0000000000000000
Debug info, reg_array[         28]: 0000000000000000
Debug info, reg_array[         29]: 0000000000000000
Debug info, reg_array[         30]: 0000000000000000
Debug info, reg_array[         31]: 0000000000000000
         25 cycles
Simulation complete via $finish(1) at time 30950 NS + 8
../Verilog/cpu_tb.v:324    $finish;
ncsim> 